# 1)კომენტარის სახით ჩამოწერე თითეული სიის ფუნქცია რაც ვისწავლეთ და მიუწერეთ გვერდით ახსნა განმარტება თუ რა გადაეცემა თითეულს და რას აკეთებს ის
# .append - ის გვაძლევს შაშვალებას სიის ბოლოში ელემენტები ჩავამატოთ
# .inset - ის გვაძლევს საშვალებას რომ სიაში გარკვეულ ინდექსებზე ეკემენტები დავამატოთ
# . pop  - ის გვაძლევს საშვალებას სიიდან გარკვეული ინდექსი წავშალოთ 
# . remove - ის გვაძლევს საშვალებას სიიდან გარკვეული მნიშვნელობა წავშალოთ 
# 2)შექმენი რიცხვების სია.
# append() ფუნქციით დაამატე მასში რიცხვი 10 ბოლოში.
# დაბეჭდე სია რომ ნახო ჩაემატა თუ არა
nums=[1,2,4,4,5,6,7,8,]
nums.append(5)
print(nums)
# 3)შექმენი სახელების სია.
# append() ფუნქციით დაამატე შენი სახელი სიის ბოლოში
# დაბეჭდე სია.
names = ["lasha","vaxo","shota","davita"]
names.append("nikolozi")
# 4)შექმენი სია სადაც შეიყვან სახელებს,შენიდავალებაა მომხმარებელს შემოატანინო რაიმე სახელი და შეინახო ცვლადში,შემდეგ ჩაამატე append()ის დახმარებით სიის ბოლოში მომხმარებლის შემოტანილი სიტყვა ~
# დაბეჭდე სია რომნახო ჩაემატა თუ არა
names1 = ["lasha","vaxo","shota","davita"]
user_name = input("enter your name")
names1.append(user_name)
print(names1)

# 5)შექმენი სია სადაც შეიყვანთ 5 სახეკს
# .insert() დახმარებით სიაში ჩაამატე მესამე ინდექსზე შენი სახელი
names2 = ["lasha","vaxo","shota","davita","giorga"]
names2.insert(3,"nikolozi")
print(names2)
# 6)მომხმარებელს შემოატანინე სახელი და რიცხვი(integer 0 იდან 6 ჩათვლით)
# შენი დავალებაა შექმნა სია მინიმუმ 6 ელემენტიანი
# insert() დახმარებით დაამატე სიაში მომხმარებლის მიერ შემოტანილი რიცხვი,მომხმარებლის მიერ შემოტანილ ინდექსზე
# მაგ:მომხმარებელმა სახელი შემოიტანა საბა და რიცხვი 4 , შენი დავალებაა რომ საბა დაამატო მეოთხე ინდექსზე(გამოიყენე ცვლადის სახელები იმიტომ რომ არ იცი მომხმარებელი რა მნშვნელობებს შემოიტანს
# დაბეჭდე სია რომ ნახო ჩაემატა თუ არა
user_input = int(input("enter any number 0-6"))
user_input2 = input("enter any word ")
list_1 = [1,2,3,4,5,6,7]
list_1.insert(user_input,user_input2)
print(list_1)

# 7)შექმენი სია:
# insert() ფუნქციით ჩასვი "orange" 1 ინდექსზე.
fruits = ["apple", "banana"]
fruits.insert(1,"orange")
print(fruits)
# 8)შექმენი სია:

names = ["goga", "saba", "luka"]
names.insert(2,"irakli")
print(names)
# insert()-ით ჩასვი "irakli" ბოლოს წინა პოზიციაზე ანუ ლუკას წინ

# 9)შექმენი სია:

foods = ["bread", "milk", "cheese"]
foods.insert(0,"water")
print(foods)

# insert() ფუნქციით ჩასვი "water" სიის დასაწყისში.

# 10)შექმენი სია:numbers = [5, 10, 15]
numbers_11 = [5, 10, 15]
numbers_11.pop(-1)
print(numbers_11)
# pop() ფუნქციით წაშალე ბოლო ელემენტი და დაბეჭდე განახლებული სია.

# 11)შექმენი სია:
# fruits = ["apple", "banana", "orange"]
fruits = ["apple", "banana", "orange"]
fruits.pop(1)
print(fruits)

# pop -ით ამოშალე "banana" და დაბეჭდე დარჩენილი სია.

# 12)შექმენი სია:

names_111 = ["goga", "saba", "luka"]
names_111.pop(1)
print(names_111)

# ამოშალე "saba" pop()-ით  — შემდეგ დაბეჭდე სია რომ ნახო ამოიშალა თუ არა

# 13)შექმენი სია:

colors = ["red", "green", "blue" , "yellow" , "black" , "purple"]
colors.pop(0)
colors.pop(2)
print(colors)

# pop()-ით წაშალე "red" და დაბეჭდე განახლებული სია.

# შემდეგ სიიდან ასევე ამოშალე yellow

# დაბეჭდე სია და ნახე შედეგი
# 14)მომხმარებელს შემოტანინე რიცხვი(0 იდან 4 მდე და შეინახე ცვლადში
usr_inp1 = int(input("enter any number (0-4)"))
items = ["pen", "pencil", "book", "eraser"]
items.pop(usr_inp1)
print(usr_inp1)
# შექმენი სია tems = ["pen", "pencil", "book", "eraser"] 
# pop ის დახმარებით სიიდან ამოშალე მომხმარებლის მიერ შემოტანილ რიცხვზე(ინდექსზე) მდგომი ელემენტი

# 15)შექმენი სია:

fruits_12= ["apple", "banana", "orange"]
fruits.remove("banana")
print(fruits)

# remove() ფუნქციით სიისდან წაშალე "banana".

# დაბეჭდე სია ნახე ამოიშალა თუ არა

# 16)შექმენი სია:

nums_123 = [3, 5, 3, 7]
nums_123.remove(3)
print(nums_123)
# remove()-ით წაშალე 3 და დააკვირდი, მხოლოდ პირველი 3 იანი შაიშლება.

# დაბეჭდე სია რომ დარწმუნდე

# 17)შექმენი სია:

colors_123 = ["red", "blue", "green"]
colors_123.remove("blue")
print(colors_123)

# remove() ფუნქციით წაშალე "blue" და დაბეჭდე განახლებული სია.

# 18)შექმენი სია:
user_word = input("enter any name from listed goga", "saba", "luka")
names_222 = ["goga", "saba", "luka"]
names_222.remove(user_word)
print(names_222)


# მომხმარებელს შემოატანინე ამ სამიდან რომელიმე სახელი შეინახე ცვლადში და remove()-ით წაშალე მომხმარებლის შემოტანილი სახელი სიიდან.

# დაბეჭდე სია რომ გაიგო მართლა ამოიშალა თუ არა

# 19)შექმენი სია:

items_321 = ["pen", "pencil", "book", "pencil"]
items.remove("pencil")
print(items_321)

# remove()-ით წაშალე "pencil" და დაბეჭდე დარჩენილი სია.

# 20)სოლოლერნის გარეშეარ დაგიშვებთ გაკვეთილზე არავის!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!