# 1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი.  
# -> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე 
# -> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.

# word = input("enter any word: ")
# print(len(word))
# for i in range(len(word)):
#     print(word[i])

# ** Level 33: **
# ```
# 1) მომხმარებელს შემოატანინე სიტყვა ანდა ტექსტი.  
# -> გაიგე ამ სიტყვის/ტექსტის სიგრძე და დაპრინტე 
# -> for ციკლით დაბეჭდე ამ სიტყვის თითოეული ასო ცალცალკე.
# user_inp = input("enter anything: ")
# print(len(user_inp))
# for i in user_inp:
#     print(i)

# 2)  შექმენით სია სადაც შეინახავთ სტრინგებს.
# დაუარეთ სიის თითოეულ ელემენტს:
# 1. დაპრინტეთ რამდენი სიმბოლოსაგან შედგება სიტყვა
# 2. თუ სიტყვის სიგრძე არის: 
# --> კენტი დაპრინტეთ 'კენტია'
# --> ლუწი დაპრინტეთ 'ლუწია'
list_0 = ["vaxo","lasha","dato","goga","nikolozi","shota"]
for i in list_0:
    print(len(i))

for i in list_0:
    if len(i) % 2 ==0:
        print("ლუწია"+i)
        
else:
    print("კენტია"+i)