# 1)მომხმარებელს შემოაყვანინეთ სახელი,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ დიდი ასოებით
name = input("enter your name: ")
print(name.upper())
# 2)მომხმარებელს შემოაყვანინეთ სახელი დიდი ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პატარა ასოებით
name2 = input("enter your name (upper_case!): ")
print(name2.lower())

# 3)მომხმარებელს შემოაყვანინეთ სახელი პატარა ასოებით,შენი დავალებაა რომ დაპრინტო მისი სახელი ოღნოდ პირველი ასო იყოს დიდი
name3 = input("enter your name (lower_case!): ")
print(name3.capitalize())

# 4)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ დიდი ასოებით
name = ["lasha","vaxo","nikolozi","daviti","goga"]
list_2 = []
for i in name:
    list_2.append(i.upper())
print(list_2)
    
# 5)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები დიდი ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პატარა ასოებით
names = ['LASHA', 'VAXO', 'NIKOLOZI', 'DAVITI', 'GOGA']
list_21 = []
for i in names:
    list_21.append(i.lower())
print(list_21)
# 6)შექმენით სია,შეინახეთ სიაში მხოლოდ სახელები პატარა ასოებით,თქვენი დავალებაა რომ გადაუაროთ ამ სიას ფორ ციკლით და დაპრინტო თითიეული სახელი ოღონდ პირველი ასო დიდიქონდეს
Names = ["lasha","vaxo","nikolozi","daviti","goga"]
list_22 = []
for i in Names:
    list_22.append(i.capitalize())
print(list_22)

    
# 7)შექმენი სია სადაც მოათავსებ ელემენტებს,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ელემენტისგან შედგება ეს სია,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სიის სიგრძეს
this_list = [1,2,3,4,5,6,7]
print(len(this_list))
# 8)შექმენი სტრინგი --> ალექსანდრე ,თქვენი დავალებაა რომ ტერმინალში დაპრინტოთ თუ რამდენი ასოსგან შედგება ეს სტრინგი,გამოიყენეთ ნასწავლი ფუნქცია რომელიც პოულობდა სტრინგის სიგრძეს
name = "ალექსანდრე"
print(len(name))
# 9)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი ლუწი რიცხვების რაოდნობა
numbers = [1,2,3,4,5,6,7,8,9,10]
count = 0
for i in numbers:
    if i % 2 ==0:
        count += 1
        print(f"სიაში არის {count}ლუწი რიცხვი!")
# 10)შექმენით სია სადაც მოათავსებთ მხოლოდ რიცხვებს,თქვენი დავალებაა რომ გაიგოთ ამ სიაში მყოფი კენტი რიცხვების რაოდნობა
numbers_2 = [1,2,3,4,5,6,7,8,9,10]
count_2 = 0
for i in numbers_2:
    if i % 2 != 0:
        count_2 += 1
        print(f"სიაში არის {count_2}კენტი რიცხვი!")
# 11)მომხმარებელს შემოაყვანინე ორი რიცხვი start , end და step , თქვენი დავალებაა დაატრიალოთ ფორ ციკლი start იდან end ამდე და სტეპი იყოს step,ამ დიაპაზონში გამოიტანეთ ტერმინალში მხოლოდ ლუწი რიცხვები
start = int(input("enter any number(start!): "))
end = int(input("enter any number(end!): "))
step = int(input("enter any number(step!): "))
for i in range(start,end,step):
    if i %2 ==0:
        print(f"ლუწი რიცხვია{i}")